;Inno Setup XDELTA Patch Language file v1.3 for ISXPM 2.4.0.0 
;Language: Portuguese
;Author: Kassane

[ISPATCH]
;Buttons
START_BUTTON='Iniciar'
BROWSE_BUTTON='Buscar'
INFO_BUTTON='Info'
EXIT_BUTTON='Sair'
BACKUP_BUTTON='Salvar Backup'
LOG_BUTTON='Salvar Log'
MUSIC_BUTTON_PLAY='Música'
MUSIC_BUTTON_PAUSE='Música'
VERIFY_BUTTON='Verificar Hash'
CLOSE_BUTTON='Fechar'

;Logs
ROLLBACK_STARTED='Restauração iniciada!'
ROLLBACK_END='Ocorreu um erro. Recuperação foi aplicado. Todos os arquivos patched foram restaurados.'

FAILED_TO_ROLLBACK='[!]  Erro: Falha ao recuperar de: '
FAILED_TO_ROLLBACK2=' para arquivo: '

ROLLBACK_SUCCESS2=' para: '
ROLLBACK_SUCCESS3=' successo.'

FAILED_TO_DELETE_INCLUDED='[!]  Erro: Falha para deletar o incluso: '

INCLUDED_DELETED_SUCCESS2=' deletado com successo.'

INCLUDED_DIR_DELETED2=' está vazio e foi deletado com sucesso.'

BACKUP_DIR_DELETED2=' foi deletado.'

BACKUP_DIR_DELETED_NOT_FULLY2=' foi limpado mas alguns arquivos usados ou pastas estão indisponiveis para deletar. Verifique este diretório para mais detalhes.'

ROLLBACK_FINISHED='Restauração finalizada!'
PATCHING_FINIFHED_WITH_ERRORS='[!]  Patching finalizado com erros!'

EXTRACT_TEMP_PATCH_DATA='Extraindo patch-data para diretório temp...'

START_PATCHING='[Iniciando sessão patching]'

TARGET_FILE='--> Arquivo Fonte: '
PATCH_DATA_FILE='=> Arquivo Patch-data: '
OUTPUT_PATCHED='>> Saída do patched: '

ERROR_DELETING_OLD_FILE='[!]  Erro foi ocorrido enquando deletava o arquivo original antigo! Talvez esteja em uso!'

NOT_EXISTS_OR_MISSMATCH='[!]  Erro: Arquivos para patching em diretório não existem ou corromperam.'
CORRECT_PROBLEM='[!]  Por favor corrija o problema e aplique o Patch novamente.'

PATCHING_END='[Finalizando sessão patching]'
COPYING_START='[Iniciando sessão de cópia]'

COPY_FAILED='[!]  Erro: Falha ao copiar arquivo incluso: '
COPY_FAILED2=' para:'

COPY_IN_USE='Talvez '
COPY_IN_USE2=' em uso!'

INCLUDED_COPYIED2=' é copiado para: '

COPYING_END='[Finalizando sessão de cópia]'

TEMP_ROLLBACK_DELETED_IN_USE2=' foi absolvido, mas alguns arquivos ou pastas usados incapazes de eliminar. Marque este diretório para mais detalhes.'

EXTERNAL_COPYIED='Arquivos externos adicionais foi copiado para: '

STORED_BACKUP='Os arquivos de backup armazenados em: '

OPERATION_SUCCESS='A operação foi concluída com êxito!'

;Checks
FIND_BY_WINDOW_NAME='Execução de aplicativo detectado!'
FIND_BY_WINDOW_NAME2='Por favor feche '
FIND_BY_WINDOW_NAME3=' então execute o Patch novamente!'

FIND_BY_CLASS_NAME='Execução de aplicativo detectado!'
FIND_BY_CLASS_NAME2='Por favor feche '
FIND_BY_CLASS_NAME3=' então execute o Patch novamente!'

FIND_BY_MUTEX='Execução de aplicativo detectado!'
FIND_BY_MUTEX2='Por favor feche '
FIND_BY_MUTEX3=' então execute o Patch novamente!'

FIND_BY_PROC='Execução de aplicativo detectado!'
FIND_BY_PROC2='Por favor feche '
FIND_BY_PROC3=' então execute o Patch novamente!'

;Errors
ORIGINAL_NOT_FOUND='Instalação original não foi encontrado! Por favor selecione a pasta válida!'

ROLLBACK_ERROR='Erro durante patching foi ocorrido e aplicar Patch o retorno.'
ROLLBACK_ERROR2='Recuperação dos arquivos modificados está completa. Arquivos inclusos foram deletados.'
ROLLBACK_ERROR3='Remover diretório de backup: '
ROLLBACK_ERROR4='totalmente com todos os arquivos inclusos e subdiretórios?'

INCORRECR_PATH_ENTERED='Pasta inserida é incorreta! Por favor selecione o diretório de instalação!'

NOTHING_TO_PATCH='Erro! No diretório de instalação não existe arquivos necessários para patching!'
NOTHING_TO_PATCH2='Por favor verifique os arquivos originais ou o nome dos arquivos selecionados no diretório!'
NOTHING_TO_PATCH3='Patch indefinido!'
FINISHED_WITH_ERRORS='Patch finalzado com erros! Verifique o log para mais detalhes!'
PATCH_UNSUCCESS='[!]  Ocorreu erro(s) durante o patching!'

;Informations
BROWSE_DIALOG='Por favor selecione a pasta para localizar a diretório de destino:'

PATCHING_PROCESS='Processo patching, por favor aguarde...'
PATCH_APPLIED='Patch foi aplicado!'
PATCHING='Patching: '
PATCHING_ERROR='Patch não foi aplicado!'
PATCHING_PREPARING='Preparanddo para patching...'
COPYING_PROCESS='Copiando processo, por favor aguarde...'
COPYING_EXTERNAL='Copiando arquivos externos...'
FORM_CLOSED='A janela do Patch é fechado automaticamente depois '
FORM_CLOSED2=' segundos.'

;new 0.8
DELETING_JUNKED='[Deletando sessão inicial dos arquivos inúteis]'
COMPLETING_JUNKED='[Deletando sessão final dos arquivos inúteis]'
JUNKED_REMOVED='--> Arquivo inútil removido: '
JUNKED_REM_FAILED='[!]  Falha ao remover arquivo inútil: '
FAILED_TO_RESTORE='[!]  Erro: Falha ao restaurar arquivo inútil para: '
FAILED_TO_RESTORE2=' para: '
JUNKED_RESTORED='Arquivo Inutilizável: '
JUNKED_RESTORED2=' é restaurado com sucesso.'

;new 0.9
;ALLREADY_UPDATED='Applicação já foi atualizada!'


; Language update 0.9a for ISXPM 2.0.0.0 beta 1 
INCORRECT_HASH='Verificação de hash, não é do arquivo original!'
INCORRECT_HASH2='Por favor verifique a versão do  seu programa!'
INVALID_HASH='[!]  Erro! Verificação inválida para: '
VALID_HASH='OK! Verificação válida para: '

SET_ATTRIBUTES='Conjunto de atributos de arquivos...'
SET_ATTRIBUTES_FAILED='[!]  Falha ao definir atributos originais para arquivo: '
SET_ATTRIBUTES_SUCCESS='Atributos de arquivos foi definida com êxito!'
SET_ATTRIBUTES_UNSUCCESS='[!]  Alguns atributos de arquivos não foi definido!'

HANDLE_ERROR='[!]  Ocorreu um erro crítico enquanto acessava o(a): '

GET_TIME_FAILED='[!]  Falha ao obter atributos de tempo do arquivo: '
SET_TIME_FAILED='[!]  Falha ao definir atributos de tempo do arquivo: '

VERIFICATION_START='Iniciando processo de verificação de arquivos...'
VERIFICATION_FINISH='Todas as verificações de arquivos estão corretos!'

PREPARING_TO_OPERATIONS='Preparando-se para as próximas operações, esperando para descarregar patch engine...'

FORCE_PATCHING='Patching está funcionando de modo forçado!'
FORCE_PATCHING2='Será atualizado só existia arquivos necessários, todos inexistente será ignorado...'

COPYING_EXTERNAL_FILE='--> Copiando aruqivo para: '
COPYING_EXTERNAL_FILE_FAILED='[!]  Alguns erros ocorreram enquanto copiava os arquivos: ' 

EXTRACTING_PROCESS='Extraindo arquivos externos...'
EXTRACTING_EXTERNAL_FILE='--> Extraindo arquivos para: '
EXTERNAL_EXTRACTED='Arquivos externos adicionais foram extraídos para: '
EXTRACTING_START='Extraindo dados, por favor aguarde...'

EXTRACTING_ERROR='[!]  Falha ao descomprimir! Talvez o arquivo esteja corrompido ou não tem espaço livre!'
EXTRACTING_ERROR2='Ocorreu um erro enquanto extraia o arquivo!'
EXTRACTING_ERROR3='Talvez o arquivo esteja corrompido ou não tem espaço livre!'
EXTRACTING_WITH_ERRORS='Arquivos extraídos sem erros! Verifique o log para mais detalhes!'

DOWNLOAD_REQUIRED='Este patch requer baixar alguns dados a partir do servidor!'
DOWNLOAD_FAILED='[!]  Não é possível continuar o processo de patching sem dados necessários!'
DOWNLOAD_FAILED2='Por favor, forneça o acesso ao servidor de conexão e tentar aplicar o patch novamente!'

DOWNLOAD_MIRROR='Falha ao baixar os dados do servidor principal! Tente fazer o download no alternativo...'
DOWNLOAD_START='Baixando dados: '
DOWNLOAD_START2='Para a localização: '
DOWNLOAD_START3='Tamanho total: '

READ_OK='Baixado com sucesso!'
CONNECT_ERROR_NETWORK='[!]  Erro: Não há conexão com a Internet, ou se todas as conexões de Internet possíveis não estão atualmente ativas.'
CONNECT_ERROR_OFFLINE='[!]  Erro: O computador está desconectado.'
CONNECT_ERROR_INITIALIZE='[!]  Erro: Falha ao inicializar o pacote de instalação para acessar Internet.'
CONNECT_ERROR_OPENSESSION='[!]  Erro: Falha ao abrir a sessão de FTP ou HTTP.'
CONNECT_ERROR_CREATEREQUEST='[!]  Erro: Falha ao criar uma solicitação do controlador HTTP.'
CONNECT_ERROR_SENDREQUEST='[!]  Erro: Falha ao enviar solicitação para o servidor HTTP.'
READ_ERROR_DELETEFILE='[!]  Erro: O arquivo local existe, e falha ao excluí-lo.'
READ_ERROR_SAVEFILE='[!]  Erro: Falha ao salvar dados para o arquivo local.'
READ_ERROR_CANCELED='[!]  Erro: O usuário desistiu de continuar o download.'
READ_ERROR_READDATA='[!]  Erro: Falha ao ler dados a partir do URL remoto.'
UNKNOWN_ERROR='[!]  Erro desconhecido: O estado do código HTTP é: '

CANCEL_DOWNLOAD_BUTTON='Cancelar Download'

;old corrected
TOTAL_PATCHED_FILES='Total de arquivos processados: '
PATCHING_LOG='Log do patching foi salvo em: '
INCLUDED_COPYIED='--> Arquivo incluso: '
TEMP_ROLLBACK_DELETED='Arquivos temporários para recuperação foram apagados em: '
DIRECT_PATCH_DATA='Acesso direto ao patch-data...'

;Strings
DESCRIPTION='Descrição:'
COPYRIGHT='Direitos Autorais:'
CONTACT='Contato:'
INSTALLATION='Instalação:'

;no more used this strings from previous old translation versions
;INCORRECT_MD5='Hash MD5 não é do arquivo original!'
;INCORRECT_MD52='Por favor verifique a versão do programa!'
;INVALID_HASH='[!]  Hash MD5 inválido para arquivos atualizados: '
;VALID_HASH='Hash MD5 válido para arquivos atualizados: '
;TEMP_ROLLBACK_DELETED2=' foi apagado.'


; Language update 0.9b for ISXPM 2.0.0.0 beta 2 
PATCH_TO='Patch para'
FOUNDED_VERSION='Versão instalada foi encontrado: '
VERSION_TO_PATCH='Preparando para patching usando a versão atual: '

;old corrected:
;INSTALL_PATH_NOT_FOUND='Install path for required version not found! Please select it manually!'

ALLREADY_UPDATED='Aplicação neste local já está atualizado!'
ROLLBACK_SUCCESS='Recuperar: '
INCLUDED_DIR_DELETED='Dir incluido: '
INCLUDED_DELETED_SUCCESS='Incluido: '
BACKUP_DIR_DELETED='Dir dos Backups: '
BACKUP_DIR_DELETED_NOT_FULLY='Dir dos Backups: '
TEMP_ROLLBACK_DELETED_IN_USE='Recuperando dir temporário: '


; Language update 1.0 for ISXPM 2.0.0.0 release candidate 
EXTRACT_TO_TEMP='Extraindo dados requeridos temporariamente...'
EXTRACT_TO_TEMP2='Extraindo dados, por favor aguarde...'
FOUNDED_VERSION_READY='Pronto para criar Patch!'
FILE_NOT_EXISTS='[!]  O arquivo requerido para o processo não existe: '

;old corrected:
INSTALL_PATH_NOT_FOUND='Caminho de instalação para a versão necessária não encontrado! Por favor, selecione ele!'
FOUNDED_VERSION2='Versão instalada foi encontrado! Pronto para criar Patch!'
VERIFICATION_UNSUCCESS='[!]  Alguns arquivos não existem ou a verificação está incorreta!'
UNKNOWN_PATCHING_ERROR='[!]  Ocorreram alguns erros enquanto aplicava patch-data em: '

; Language update 1.1 for ISXPM 2.2.0.0 
LOG_BTN_STATE='Log'

S_PATCHING='--> Patching arquivo: '
S_COPYING='--> Copiando arquivo: '
S_EXTRACTING='--> Extraindo arquivo: '
S_COPYING_EXTERNAL='--> Copiando arquivo externo: '
S_ROLLBACK='--> Recuperando arquivo: '
S_DELETING='--> Apagando arquivo: '
S_JUNKED_RESTORED='--> Resto de arquivo restaurado: '
S_INVALID_FILE='[!]  Arquivo Inválido: '
S_VALID_FILE='OK! Arquivo Válido: '

; Language update 1.2 for ISXPM 2.3.0.0 
VERSION_DETECTING='Detectando versão... Por favor aguarde...'

; Language update 1.2.1 for ISXPM 2.3.1.0 
FILE_SKIPPED='[!]  Procurando arquivos inexistentes e esquecidos: '

; Language update 1.3 for ISXPM 2.4.0.0 
GET_SPACE_FAILED='Falha ao detectar espaço livre em '
REQUIRED_SPACE='Requer espaço para atualizar com sucesso este '
SPACE_GB='GB!'
SPACE_MB='MB!'
SPACE_ONLY='Apenas '
SPACE_GB_FREE='GB livre no volume '
SPACE_MB_FREE='MB livre no volume '
SPACE_FREE_ONLY='Somente livre '